In [1]:
import numpy as np
import pandas as pd
from sklearn.preprocessing import LabelEncoder, OneHotEncoder

In [23]:
df = pd.read_excel('Data/onedata.xlsx')
df

   buyer  fruits  gender  value
0    ali   apple    male      2
1   noor   mango    male      3
2  wajid  orange  female      4
3  karim  banana    male      4

In [24]:
le = LabelEncoder()
df['gender'] = le.fit_transform(df['gender'])
df

   buyer  fruits  gender  value
0    ali   apple       1      2
1   noor   mango       1      3
2  wajid  orange       0      4
3  karim  banana       1      4

In [25]:
# can also do OneHotEncoder(drop='first', dtype=int)
ohe = OneHotEncoder(sparse_output=False)
temp_data = ohe.fit_transform(df[['buyer', 'fruits']])
tempdf = pd.DataFrame(data=temp_data, columns=ohe.get_feature_names_out())
tempdf

,buyer_ali,buyer_karim,buyer_noor,buyer_wajid,fruits_apple,fruits_banana,fruits_mango,fruits_orange
0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
1,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0
2,0.0,0.0,0.0,1.0,0.0,0.0,0.0,1.0
3,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0

In [29]:
finaldf = pd.concat([df, tempdf], axis=1)
finaldf.head()

,buyer,fruits,gender,value,buyer_ali,buyer_karim,buyer_noor,buyer_wajid,fruits_apple,fruits_banana,fruits_mango,fruits_orange
0,ali,apple,1,2,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
1,noor,mango,1,3,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0
2,wajid,orange,0,4,0.0,0.0,0.0,1.0,0.0,0.0,0.0,1.0
3,karim,banana,1,4,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0

In [34]:
finaldff = finaldf.drop(columns=['buyer', 'fruits'], axis=1)
finaldff

,gender,value,buyer_ali,buyer_karim,buyer_noor,buyer_wajid,fruits_apple,fruits_banana,fruits_mango,fruits_orange
0,1,2,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
1,1,3,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0
2,0,4,0.0,0.0,0.0,1.0,0.0,0.0,0.0,1.0
3,1,4,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0